app/views/mainpage/index.html.erb

SELECT  "x2ts".* FROM "x2ts"  ORDER BY "x2ts"."id" DESC LIMIT 1
---
      <div class="well" style="height: 82px;">
        <% if !X2t.last.nil? %>