app/controllers/mainpage_controller.rb

  def index
    @x2t_last = X2t.last
---
SELECT  "x2ts".* FROM "x2ts"  ORDER BY "x2ts"."id" DESC LIMIT 1

  def update
    # delete_files
    case
      when !params[:x2t].nil?
        uploaded_io = params[:x2t]
        File.open(Rails.root.join('public', 'x2t', uploaded_io.original_filename), 'wb') do |file|
---
SELECT  "x2ts".* FROM "x2ts"  ORDER BY "x2ts"."id" DESC LIMIT 1